tinyrtx/pic16f/docs/pic16f1847 reference.inc
// Register: TOSL
TOSL                                     equ 0FEEh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh

// Register: TOSH
TOSH                                     equ 0FEFh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0007h
TOSH_TOSH_LENGTH                         equ 0007h
TOSH_TOSH_MASK                           equ 007Fh
/*
 * Bit Access Macros
 *  */
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ABDEN                            BANKMASK(BAUDCON), 0
#define ABDOVF                           BANKMASK(BAUDCON), 7
#define ADCS0                            BANKMASK(ADCON1), 4
#define ADCS1                            BANKMASK(ADCON1), 5
#define ADCS2                            BANKMASK(ADCON1), 6
#define ADDEN                            BANKMASK(RCSTA), 3
#define ADFM                             BANKMASK(ADCON1), 7
#define ADFVR0                           BANKMASK(FVRCON), 0
#define ADFVR1                           BANKMASK(FVRCON), 1
#define ADGO                             BANKMASK(ADCON0), 1
#define ADIE                             BANKMASK(PIE1), 6
#define ADIF                             BANKMASK(PIR1), 6
#define ADNREF                           BANKMASK(ADCON1), 2
#define ADON                             BANKMASK(ADCON0), 0
#define ADPREF0                          BANKMASK(ADCON1), 0
#define ADPREF1                          BANKMASK(ADCON1), 1
#define ANSA0                            BANKMASK(ANSELA), 0
#define ANSA1                            BANKMASK(ANSELA), 1
#define ANSA2                            BANKMASK(ANSELA), 2
#define ANSA3                            BANKMASK(ANSELA), 3
#define ANSA4                            BANKMASK(ANSELA), 4
#define ANSB1                            BANKMASK(ANSELB), 1
#define ANSB2                            BANKMASK(ANSELB), 2
#define ANSB3                            BANKMASK(ANSELB), 3
#define ANSB4                            BANKMASK(ANSELB), 4
#define ANSB5                            BANKMASK(ANSELB), 5
#define ANSB6                            BANKMASK(ANSELB), 6
#define ANSB7                            BANKMASK(ANSELB), 7
#define BCL1IE                           BANKMASK(PIE2), 3
#define BCL1IF                           BANKMASK(PIR2), 3
#define BCL2IE                           BANKMASK(PIE4), 1
#define BCL2IF                           BANKMASK(PIR4), 1
#define BORRDY                           BANKMASK(BORCON), 0
#define BRG16                            BANKMASK(BAUDCON), 3
#define BRGH                             BANKMASK(TXSTA), 2
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
#define BSR3                             BANKMASK(BSR), 3
#define BSR4                             BANKMASK(BSR), 4
#define C1HYS                            BANKMASK(CM1CON0), 1
#define C1IE                             BANKMASK(PIE2), 5
#define C1IF                             BANKMASK(PIR2), 5
#define C1INTN                           BANKMASK(CM1CON1), 6
#define C1INTP                           BANKMASK(CM1CON1), 7
#define C1NCH0                           BANKMASK(CM1CON1), 0
#define C1NCH1                           BANKMASK(CM1CON1), 1
#define C1OE                             BANKMASK(CM1CON0), 5
#define C1ON                             BANKMASK(CM1CON0), 7
#define C1OUT                            BANKMASK(CM1CON0), 6
#define C1PCH0                           BANKMASK(CM1CON1), 4
#define C1PCH1                           BANKMASK(CM1CON1), 5
#define C1POL                            BANKMASK(CM1CON0), 4
#define C1SP                             BANKMASK(CM1CON0), 2
#define C1SYNC                           BANKMASK(CM1CON0), 0
#define C1TSEL0                          BANKMASK(CCPTMRS), 0
#define C1TSEL1                          BANKMASK(CCPTMRS), 1
#define C2HYS                            BANKMASK(CM2CON0), 1
#define C2IE                             BANKMASK(PIE2), 6
#define C2IF                             BANKMASK(PIR2), 6
#define C2INTN                           BANKMASK(CM2CON1), 6
#define C2INTP                           BANKMASK(CM2CON1), 7
#define C2NCH0                           BANKMASK(CM2CON1), 0
#define C2NCH1                           BANKMASK(CM2CON1), 1
#define C2OE                             BANKMASK(CM2CON0), 5
#define C2ON                             BANKMASK(CM2CON0), 7
#define C2OUT                            BANKMASK(CM2CON0), 6
#define C2PCH0                           BANKMASK(CM2CON1), 4
#define C2PCH1                           BANKMASK(CM2CON1), 5
#define C2POL                            BANKMASK(CM2CON0), 4
#define C2SP                             BANKMASK(CM2CON0), 2
#define C2SYNC                           BANKMASK(CM2CON0), 0
#define C2TSEL0                          BANKMASK(CCPTMRS), 2
#define C2TSEL1                          BANKMASK(CCPTMRS), 3
#define C3TSEL0                          BANKMASK(CCPTMRS), 4
#define C3TSEL1                          BANKMASK(CCPTMRS), 5
#define C4TSEL0                          BANKMASK(CCPTMRS), 6
#define C4TSEL1                          BANKMASK(CCPTMRS), 7
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1AS0                          BANKMASK(CCP1AS), 4
#define CCP1AS1                          BANKMASK(CCP1AS), 5
#define CCP1AS2                          BANKMASK(CCP1AS), 6
#define CCP1ASE                          BANKMASK(CCP1AS), 7
#define CCP1IE                           BANKMASK(PIE1), 2
#define CCP1IF                           BANKMASK(PIR1), 2
#define CCP1M0                           BANKMASK(CCP1CON), 0
#define CCP1M1                           BANKMASK(CCP1CON), 1
#define CCP1M2                           BANKMASK(CCP1CON), 2
#define CCP1M3                           BANKMASK(CCP1CON), 3
#define CCP1SEL                          BANKMASK(APFCON0), 0
#define CCP2AS0                          BANKMASK(CCP2AS), 4
#define CCP2AS1                          BANKMASK(CCP2AS), 5
#define CCP2AS2                          BANKMASK(CCP2AS), 6
#define CCP2ASE                          BANKMASK(CCP2AS), 7
#define CCP2IE                           BANKMASK(PIE2), 0
#define CCP2IF                           BANKMASK(PIR2), 0
#define CCP2M0                           BANKMASK(CCP2CON), 0
#define CCP2M1                           BANKMASK(CCP2CON), 1
#define CCP2M2                           BANKMASK(CCP2CON), 2
#define CCP2M3                           BANKMASK(CCP2CON), 3
#define CCP2SEL                          BANKMASK(APFCON0), 3
#define CCP3IE                           BANKMASK(PIE3), 4
#define CCP3IF                           BANKMASK(PIR3), 4
#define CCP3M0                           BANKMASK(CCP3CON), 0
#define CCP3M1                           BANKMASK(CCP3CON), 1
#define CCP3M2                           BANKMASK(CCP3CON), 2
#define CCP3M3                           BANKMASK(CCP3CON), 3
#define CCP4IE                           BANKMASK(PIE3), 5
#define CCP4IF                           BANKMASK(PIR3), 5
#define CCP4M0                           BANKMASK(CCP4CON), 0
#define CCP4M1                           BANKMASK(CCP4CON), 1
#define CCP4M2                           BANKMASK(CCP4CON), 2
#define CCP4M3                           BANKMASK(CCP4CON), 3
#define CDAFVR0                          BANKMASK(FVRCON), 2
#define CDAFVR1                          BANKMASK(FVRCON), 3
#define CFGS                             BANKMASK(EECON1), 6
#define CHS0                             BANKMASK(ADCON0), 2
#define CHS1                             BANKMASK(ADCON0), 3
#define CHS2                             BANKMASK(ADCON0), 4
#define CHS3                             BANKMASK(ADCON0), 5
#define CHS4                             BANKMASK(ADCON0), 6
#define CLKRDC0                          BANKMASK(CLKRCON), 3
#define CLKRDC1                          BANKMASK(CLKRCON), 4
#define CLKRDIV0                         BANKMASK(CLKRCON), 0
#define CLKRDIV1                         BANKMASK(CLKRCON), 1
#define CLKRDIV2                         BANKMASK(CLKRCON), 2
#define CLKREN                           BANKMASK(CLKRCON), 7
#define CLKROE                           BANKMASK(CLKRCON), 6
#define CLKRSLR                          BANKMASK(CLKRCON), 5
#define CPSCH0                           BANKMASK(CPSCON1), 0
#define CPSCH1                           BANKMASK(CPSCON1), 1
#define CPSCH2                           BANKMASK(CPSCON1), 2
#define CPSCH3                           BANKMASK(CPSCON1), 3
#define CPSON                            BANKMASK(CPSCON0), 7
#define CPSOUT                           BANKMASK(CPSCON0), 1
#define CPSRM                            BANKMASK(CPSCON0), 6
#define CPSRNG0                          BANKMASK(CPSCON0), 2
#define CPSRNG1                          BANKMASK(CPSCON0), 3
#define CREN                             BANKMASK(RCSTA), 4
#define CSRC                             BANKMASK(TXSTA), 7
#define C_SHAD                           BANKMASK(STATUS_SHAD), 0
#define DACEN                            BANKMASK(DACCON0), 7
#define DACLPS                           BANKMASK(DACCON0), 6
#define DACNSS                           BANKMASK(DACCON0), 0
#define DACOE                            BANKMASK(DACCON0), 5
#define DACPSS0                          BANKMASK(DACCON0), 2
#define DACPSS1                          BANKMASK(DACCON0), 3
#define DACR0                            BANKMASK(DACCON1), 0
#define DACR1                            BANKMASK(DACCON1), 1
#define DACR2                            BANKMASK(DACCON1), 2
#define DACR3                            BANKMASK(DACCON1), 3
#define DACR4                            BANKMASK(DACCON1), 4
#define DC                               BANKMASK(STATUS), 1
#define DC1B0                            BANKMASK(CCP1CON), 4
#define DC1B1                            BANKMASK(CCP1CON), 5
#define DC2B0                            BANKMASK(CCP2CON), 4
#define DC2B1                            BANKMASK(CCP2CON), 5
#define DC3B0                            BANKMASK(CCP3CON), 4
#define DC3B1                            BANKMASK(CCP3CON), 5
#define DC4B0                            BANKMASK(CCP4CON), 4
#define DC4B1                            BANKMASK(CCP4CON), 5
#define DC_SHAD                          BANKMASK(STATUS_SHAD), 1
#define EEIE                             BANKMASK(PIE2), 4
#define EEIF                             BANKMASK(PIR2), 4
#define EEPGD                            BANKMASK(EECON1), 7
#define FERR                             BANKMASK(RCSTA), 2
#define FREE                             BANKMASK(EECON1), 4
#define FVREN                            BANKMASK(FVRCON), 7
#define FVRRDY                           BANKMASK(FVRCON), 6
#define GIE                              BANKMASK(INTCON), 7
#define GO                               BANKMASK(ADCON0), 1
#define GO_nDONE                         BANKMASK(ADCON0), 1
#define HFIOFL                           BANKMASK(OSCSTAT), 3
#define HFIOFR                           BANKMASK(OSCSTAT), 4
#define HFIOFS                           BANKMASK(OSCSTAT), 0
#define INTE                             BANKMASK(INTCON), 4
#define INTEDG                           BANKMASK(OPTION_REG), 6
#define INTF                             BANKMASK(INTCON), 1
#define IOCBF0                           BANKMASK(IOCBF), 0
#define IOCBF1                           BANKMASK(IOCBF), 1
#define IOCBF2                           BANKMASK(IOCBF), 2
#define IOCBF3                           BANKMASK(IOCBF), 3
#define IOCBF4                           BANKMASK(IOCBF), 4
#define IOCBF5                           BANKMASK(IOCBF), 5
#define IOCBF6                           BANKMASK(IOCBF), 6
#define IOCBF7                           BANKMASK(IOCBF), 7
#define IOCBN0                           BANKMASK(IOCBN), 0
#define IOCBN1                           BANKMASK(IOCBN), 1
#define IOCBN2                           BANKMASK(IOCBN), 2
#define IOCBN3                           BANKMASK(IOCBN), 3
#define IOCBN4                           BANKMASK(IOCBN), 4
#define IOCBN5                           BANKMASK(IOCBN), 5
#define IOCBN6                           BANKMASK(IOCBN), 6
#define IOCBN7                           BANKMASK(IOCBN), 7
#define IOCBP0                           BANKMASK(IOCBP), 0
#define IOCBP1                           BANKMASK(IOCBP), 1
#define IOCBP2                           BANKMASK(IOCBP), 2
#define IOCBP3                           BANKMASK(IOCBP), 3
#define IOCBP4                           BANKMASK(IOCBP), 4
#define IOCBP5                           BANKMASK(IOCBP), 5
#define IOCBP6                           BANKMASK(IOCBP), 6
#define IOCBP7                           BANKMASK(IOCBP), 7
#define IOCIE                            BANKMASK(INTCON), 3
#define IOCIF                            BANKMASK(INTCON), 0
#define IRCF0                            BANKMASK(OSCCON), 3
#define IRCF1                            BANKMASK(OSCCON), 4
#define IRCF2                            BANKMASK(OSCCON), 5
#define IRCF3                            BANKMASK(OSCCON), 6
#define LATA0                            BANKMASK(LATA), 0
#define LATA1                            BANKMASK(LATA), 1
#define LATA2                            BANKMASK(LATA), 2
#define LATA3                            BANKMASK(LATA), 3
#define LATA4                            BANKMASK(LATA), 4
#define LATA6                            BANKMASK(LATA), 6
#define LATA7                            BANKMASK(LATA), 7
#define LATB0                            BANKMASK(LATB), 0
#define LATB1                            BANKMASK(LATB), 1
#define LATB2                            BANKMASK(LATB), 2
#define LATB3                            BANKMASK(LATB), 3
#define LATB4                            BANKMASK(LATB), 4
#define LATB5                            BANKMASK(LATB), 5
#define LATB6                            BANKMASK(LATB), 6
#define LATB7                            BANKMASK(LATB), 7
#define LFIOFR                           BANKMASK(OSCSTAT), 1
#define LWLO                             BANKMASK(EECON1), 5
#define MC1OUT                           BANKMASK(CMOUT), 0
#define MC2OUT                           BANKMASK(CMOUT), 1
#define MDBIT                            BANKMASK(MDCON), 0
#define MDCH0                            BANKMASK(MDCARH), 0
#define MDCH1                            BANKMASK(MDCARH), 1
#define MDCH2                            BANKMASK(MDCARH), 2
#define MDCH3                            BANKMASK(MDCARH), 3
#define MDCHODIS                         BANKMASK(MDCARH), 7
#define MDCHPOL                          BANKMASK(MDCARH), 6
#define MDCHSYNC                         BANKMASK(MDCARH), 5
#define MDCL0                            BANKMASK(MDCARL), 0
#define MDCL1                            BANKMASK(MDCARL), 1
#define MDCL2                            BANKMASK(MDCARL), 2
#define MDCL3                            BANKMASK(MDCARL), 3
#define MDCLODIS                         BANKMASK(MDCARL), 7
#define MDCLPOL                          BANKMASK(MDCARL), 6
#define MDCLSYNC                         BANKMASK(MDCARL), 5
#define MDEN                             BANKMASK(MDCON), 7
#define MDMS0                            BANKMASK(MDSRC), 0
#define MDMS1                            BANKMASK(MDSRC), 1
#define MDMS2                            BANKMASK(MDSRC), 2
#define MDMS3                            BANKMASK(MDSRC), 3
#define MDMSODIS                         BANKMASK(MDSRC), 7
#define MDOE                             BANKMASK(MDCON), 6
#define MDOPOL                           BANKMASK(MDCON), 4
#define MDOUT                            BANKMASK(MDCON), 3
#define MDSLR                            BANKMASK(MDCON), 5
#define MFIOFR                           BANKMASK(OSCSTAT), 2
#define OERR                             BANKMASK(RCSTA), 1
#define OSFIE                            BANKMASK(PIE2), 7
#define OSFIF                            BANKMASK(PIR2), 7
#define OSTS                             BANKMASK(OSCSTAT), 5
#define P1CSEL                           BANKMASK(APFCON0), 1
#define P1DC0                            BANKMASK(PWM1CON), 0
#define P1DC1                            BANKMASK(PWM1CON), 1
#define P1DC2                            BANKMASK(PWM1CON), 2
#define P1DC3                            BANKMASK(PWM1CON), 3
#define P1DC4                            BANKMASK(PWM1CON), 4
#define P1DC5                            BANKMASK(PWM1CON), 5
#define P1DC6                            BANKMASK(PWM1CON), 6
#define P1DSEL                           BANKMASK(APFCON0), 2
#define P1M0                             BANKMASK(CCP1CON), 6
#define P1M1                             BANKMASK(CCP1CON), 7
#define P1RSEN                           BANKMASK(PWM1CON), 7
#define P2BSEL                           BANKMASK(APFCON0), 4
#define P2DC0                            BANKMASK(PWM2CON), 0
#define P2DC1                            BANKMASK(PWM2CON), 1
#define P2DC2                            BANKMASK(PWM2CON), 2
#define P2DC3                            BANKMASK(PWM2CON), 3
#define P2DC4                            BANKMASK(PWM2CON), 4
#define P2DC5                            BANKMASK(PWM2CON), 5
#define P2DC6                            BANKMASK(PWM2CON), 6
#define P2M0                             BANKMASK(CCP2CON), 6
#define P2M1                             BANKMASK(CCP2CON), 7
#define P2RSEN                           BANKMASK(PWM2CON), 7
#define PEIE                             BANKMASK(INTCON), 6
#define PLLR                             BANKMASK(OSCSTAT), 6
#define PS0                              BANKMASK(OPTION_REG), 0
#define PS1                              BANKMASK(OPTION_REG), 1
#define PS2                              BANKMASK(OPTION_REG), 2
#define PSA                              BANKMASK(OPTION_REG), 3
#define PSS1AC0                          BANKMASK(CCP1AS), 2
#define PSS1AC1                          BANKMASK(CCP1AS), 3
#define PSS1BD0                          BANKMASK(CCP1AS), 0
#define PSS1BD1                          BANKMASK(CCP1AS), 1
#define PSS2AC0                          BANKMASK(CCP2AS), 2
#define PSS2AC1                          BANKMASK(CCP2AS), 3
#define PSS2BD0                          BANKMASK(CCP2AS), 0
#define PSS2BD1                          BANKMASK(CCP2AS), 1
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RA6                              BANKMASK(PORTA), 6
#define RA7                              BANKMASK(PORTA), 7
#define RB0                              BANKMASK(PORTB), 0
#define RB1                              BANKMASK(PORTB), 1
#define RB2                              BANKMASK(PORTB), 2
#define RB3                              BANKMASK(PORTB), 3
#define RB4                              BANKMASK(PORTB), 4
#define RB5                              BANKMASK(PORTB), 5
#define RB6                              BANKMASK(PORTB), 6
#define RB7                              BANKMASK(PORTB), 7
#define RCIDL                            BANKMASK(BAUDCON), 6
#define RCIE                             BANKMASK(PIE1), 5
#define RCIF                             BANKMASK(PIR1), 5
#define RD                               BANKMASK(EECON1), 0
#define RX9                              BANKMASK(RCSTA), 6
#define RX9D                             BANKMASK(RCSTA), 0
#define RXDTSEL                          BANKMASK(APFCON0), 7
#define SBOREN                           BANKMASK(BORCON), 7
#define SCKP                             BANKMASK(BAUDCON), 4
#define SCS0                             BANKMASK(OSCCON), 0
#define SCS1                             BANKMASK(OSCCON), 1
#define SDO1SEL                          BANKMASK(APFCON0), 6
#define SENDB                            BANKMASK(TXSTA), 3
#define SPEN                             BANKMASK(RCSTA), 7
#define SPLLEN                           BANKMASK(OSCCON), 7
#define SRCLK0                           BANKMASK(SRCON0), 4
#define SRCLK1                           BANKMASK(SRCON0), 5
#define SRCLK2                           BANKMASK(SRCON0), 6
#define SREN                             BANKMASK(RCSTA), 5
#define SRLEN                            BANKMASK(SRCON0), 7
#define SRNQEN                           BANKMASK(SRCON0), 2
#define SRPR                             BANKMASK(SRCON0), 0
#define SRPS                             BANKMASK(SRCON0), 1
#define SRQEN                            BANKMASK(SRCON0), 3
#define SRRC1E                           BANKMASK(SRCON1), 0
#define SRRC2E                           BANKMASK(SRCON1), 1
#define SRRCKE                           BANKMASK(SRCON1), 2
#define SRRPE                            BANKMASK(SRCON1), 3
#define SRSC1E                           BANKMASK(SRCON1), 4
#define SRSC2E                           BANKMASK(SRCON1), 5
#define SRSCKE                           BANKMASK(SRCON1), 6
#define SRSPE                            BANKMASK(SRCON1), 7
#define SS1SEL                           BANKMASK(APFCON0), 5
#define SSP1IE                           BANKMASK(PIE1), 3
#define SSP1IF                           BANKMASK(PIR1), 3
#define SSP2IE                           BANKMASK(PIE4), 0
#define SSP2IF                           BANKMASK(PIR4), 0
#define STKOVF                           BANKMASK(PCON), 7
#define STKUNF                           BANKMASK(PCON), 6
#define STR1A                            BANKMASK(PSTR1CON), 0
#define STR1B                            BANKMASK(PSTR1CON), 1
#define STR1C                            BANKMASK(PSTR1CON), 2
#define STR1D                            BANKMASK(PSTR1CON), 3
#define STR1SYNC                         BANKMASK(PSTR1CON), 4
#define STR2A                            BANKMASK(PSTR2CON), 0
#define STR2B                            BANKMASK(PSTR2CON), 1
#define STR2C                            BANKMASK(PSTR2CON), 2
#define STR2D                            BANKMASK(PSTR2CON), 3
#define STR2SYNC                         BANKMASK(PSTR2CON), 4
#define SWDTEN                           BANKMASK(WDTCON), 0
#define SYNC                             BANKMASK(TXSTA), 4
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T0XCS                            BANKMASK(CPSCON0), 0
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1GGO                            BANKMASK(T1GCON), 3
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GCON), 0
